src/1c/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяБД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/1c/src/Catalogs/Клиенты/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НайтиПользователя(ИдентификаторПользователя) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.ИдентификаторПользователя = &ИдентификаторПользователя";

	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ТекущийПользователь() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.ИдентификаторПользователяБД = &ИдентификаторПользователя";

	Запрос.УстановитьПараметр(
		"ИдентификаторПользователя",
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор
	);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти
